IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM7_CONTROLSS_G2_EPWM7.xml
	<register id="CONTROLSS_G2_EPWM7_XMINMAX_SHDW1" acronym="CONTROLSS_G2_EPWM7_XMINMAX_SHDW1" offset="0x6C4" width="32" description="XMINMAX Shadow 1 Register">
		<bitfield id="XMIN_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="The value in the XMIN_SHDW1 register is loaded into XMIN_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XMAX_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="The value in the XMAX_SHDW1 register is loaded into XMAX_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM7_XCMP1_SHDW2" acronym="CONTROLSS_G2_EPWM7_XCMP1_SHDW2" offset="0x700" width="32" description="Additional Compare 1 Shadow 2 Register">
		<bitfield id="XCMP1_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP1_SHDW2 Register The value in the XCMP1_SHDW2 register is loaded into XCMP1_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP1HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP1HR_SHDW2 Register  The value in the XCMP1HR_SHDW2 register is loaded into XCMP1HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM7_XCMP2_SHDW2" acronym="CONTROLSS_G2_EPWM7_XCMP2_SHDW2" offset="0x704" width="32" description="Additional Compare 2 Shadow 2 Register">
		<bitfield id="XCMP2_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_SHDW2 Register The value in the XCMP2_SHDW2 register is loaded into XCMP2_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_SHDW2 Register  The value in the XCMP2HR_SHDW2 register is loaded into XCMP2HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM7_XCMP3_SHDW2" acronym="CONTROLSS_G2_EPWM7_XCMP3_SHDW2" offset="0x708" width="32" description="Additional Compare 3 Shadow 2 Register">
		<bitfield id="XCMP3_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP3_SHDW2 Register The value in the XCMP3_SHDW2 register is loaded into XCMP3_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP3HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP3HR_SHDW2 Register  The value in the XCMP3HR_SHDW2 register is loaded into XCMP3HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM7_XCMP4_SHDW2" acronym="CONTROLSS_G2_EPWM7_XCMP4_SHDW2" offset="0x70C" width="32" description="Additional Compare 4 Shadow 2 Register">
		<bitfield id="XCMP4_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP4_SHDW2 Register The value in the XCMP4_SHDW2 register is loaded into XCMP4_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP4HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP4HR_SHDW2 Register  The value in the XCMP4HR_SHDW2 register is loaded into XCMP4HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM7_XCMP5_SHDW2" acronym="CONTROLSS_G2_EPWM7_XCMP5_SHDW2" offset="0x710" width="32" description="Additional Compare 5 Shadow 2 Register">
		<bitfield id="XCMP5_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP5_SHDW2 Register The value in the XCMP5_SHDW2 register is loaded into XCMP5_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP5HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP5HR_SHDW2 Register  The value in the XCMP5HR_SHDW2 register is loaded into XCMP5HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM7_XCMP6_SHDW2" acronym="CONTROLSS_G2_EPWM7_XCMP6_SHDW2" offset="0x714" width="32" description="Additional Compare 6 Shadow 2 Register">
		<bitfield id="XCMP6_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP6_SHDW2 Register The value in the XCMP6_SHDW2 register is loaded into XCMP6_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP6HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP6HR_SHDW2 Register  The value in the XCMP6HR_SHDW2 register is loaded into XCMP6HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM7_XCMP7_SHDW2" acronym="CONTROLSS_G2_EPWM7_XCMP7_SHDW2" offset="0x718" width="32" description="Additional Compare 7 Shadow 2 Register">
		<bitfield id="XCMP7_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_SHDW2 Register The value in the XCMP7_SHDW2 register is loaded into XCMP7_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_SHDW2 Register  The value in the XCMP7HR_SHDW2 register is loaded into XCMP7HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM7_XCMP8_SHDW2" acronym="CONTROLSS_G2_EPWM7_XCMP8_SHDW2" offset="0x71C" width="32" description="Additional Compare 8 Shadow 2 Register">
		<bitfield id="XCMP8_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_SHDW2 Register The value in the XCMP8_SHDW2 register is loaded into XCMP8_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_SHDW2 Register  The value in the XCMP8HR_SHDW2 register is loaded into XCMP8HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
